Repository: Robby2D2/soccer-assistant-coach
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# appTitle
source: Soccer Assistant Coach
es: Entrenador Asistente de Fútbol
fr: Entraîneur Assistant de Football

# settingsTitle
source: Settings
es: Configuración
fr: Paramètres

# settingsVibration
source: Alarm Vibration
es: Vibración de Alarma
fr: Vibration d'Alarme

# settingsVibrationDescription
source: Vibrate device when shift alarm triggers
es: Vibrar el dispositivo cuando se active la alarma de turno
fr: Faire vibrer l'appareil lorsque l'alarme de période se déclenche

# settingsNotifications
source: Notifications & Alarms
es: Notificaciones y Alarmas
fr: Notifications et Alarmes

# permissionNotificationsTitle
source: Allow Notifications
es: Permitir Notificaciones
fr: Autoriser les Notifications

# permissionNotificationsDescription
source: Enable shift alarms and game timers to alert you even when the app is closed.
es: Habilitar alarmas de turno y temporizadores de juego para alertarte incluso cuando la aplicación está cerrada.
fr: Activer les alarmes de période et les minuteurs de jeu pour vous alerter même lorsque l'application est fermée.

# permissionExactAlarmTitle
source: Exact Alarms
es: Alarmas Exactas
fr: Alarmes Exactes

# permissionExactAlarmDescription
source: Grant exact alarm permission so shift alarms fire at the precise second (Android 12+).
es: Otorgar permiso de alarma exacta para que las alarmas de turno se activen en el segundo preciso (Android 12+).
fr: Accorder la permission d'alarme exacte pour que les alarmes de période se déclenchent à la seconde précise (Android 12+).

# permissionRequestButton
source: Request Permissions
es: Solicitar Permisos
fr: Demander les Permissions

source: Permission Granted
es: Permiso Otorgado
fr: Permission Accordée

source: Permission Denied
es: Permiso Denegado
fr: Permission Refusée

# vibrationEnabledStatus
source: Vibration enabled
es: Vibración activada
fr: Vibration activée

# vibrationDisabledStatus
source: Vibration disabled
es: Vibración desactivada
fr: Vibration désactivée

# stopAlarmAction
source: Stop Alarm
es: Detener Alarma
fr: Arrêter l'Alarme

source: Alarm dismissed
es: Alarma descartada
fr: Alarme ignorée

# alarmDismissedBody
source: Countdown continuingâ€¦
es: Cuenta regresiva continuando…
fr: Compte à rebours en cours…

source: Alarm Customization
es: Personalización de Alarmas
fr: Personnalisation des Alarmes

# shiftAlarmsEnabled
source: Shift End Alarms
es: Alarmas de Fin de Turno
fr: Alarmes de Fin de Période

# shiftAlarmsDescription
source: Play alarm when shift time expires
es: Reproducir alarma cuando expire el tiempo del turno
fr: Jouer l'alarme lorsque le temps de période expire

# halftimeAlarmsEnabled
source: Halftime Alarms
es: Alarmas de Medio Tiempo
fr: Alarmes de Mi-temps

# halftimeAlarmsDescription
source: Play alarm at halftime in traditional games
es: Reproducir alarma en el medio tiempo en juegos tradicionales
fr: Jouer l'alarme à la mi-temps dans les jeux traditionnels

source: Alarm Sounds
es: Sonidos de Alarma
fr: Sons d'Alarme

# shiftAlarmSound
source: Shift End Sound
es: Sonido de Fin de Turno
fr: Son de Fin de Période

# halftimeAlarmSound
source: Halftime Sound
es: Sonido de Medio Tiempo
fr: Son de Mi-temps

# alarmVolume
source: Volume
es: Volumen

source: Alarm Duration
es: Duración de Alarma
fr: Durée d'Alarme

# alarmDurationDescription
source: How long alarms sound before stopping
es: Cuánto tiempo suenan las alarmas antes de detenerse
fr: Combien de temps les alarmes sonnent avant de s'arrêter

# previewSound
source: Preview
es: Vista Previa
fr: Aperçu

source: seconds
es: segundos
fr: secondes

source: Language
es: Idioma
fr: Langue

# languageDescription
source: Select the application language
es: Seleccionar el idioma de la aplicación
fr: Sélectionner la langue de l'application

source: Home
es: Inicio
fr: Accueil

source: Settings
es: Configuración
fr: Paramètres

source: Edit
es: Editar
fr: Modifier

source: Delete
es: Eliminar
fr: Supprimer

source: Cancel
es: Cancelar
fr: Annuler

source: Save
es: Parada
fr: Arrêt

source: Import Roster CSV
es: Importar CSV de Plantilla
fr: Importer CSV d'Effectif

# pasteCsvWithHeader
source: Paste CSV with header: firstName,lastName,jerseyNumber (jersey number is optional)
es: Pegar CSV con encabezado: firstName,lastName,jerseyNumber (el número de camiseta es opcional)
fr: Coller CSV avec en-tête : firstName,lastName,jerseyNumber (le numéro de maillot est optionnel)

# previewRows
source: Preview: {count} rows
es: Vista previa: {count} filas
fr: Aperçu : {count} lignes

source: Jersey #: {number}
es: Camiseta #: {number}
fr: Maillot #: {number}

source: Import
es: Importar
fr: Importer

source: Create
es: Crear
fr: Créer

source: Done
es: Hecho
fr: Terminé

source: Reset
es: Reiniciar
fr: Réinitialiser

source: Loading...
es: Cargando...
fr: Chargement...

source: Teams
es: Equipos
fr: Équipes

source: Create Team
es: Crear Equipo
fr: Créer une Équipe

source: Team name
es: Nombre del equipo
fr: Nom de l'équipe

source: Manage Teams
es: Gestionar Equipos
fr: Gérer les Équipes

source: Manage Seasons
es: Gestionar temporadas
fr: Gérer les saisons

# noActiveSeasons
source: No Active Season
es: Sin Temporada Activa
fr: Aucune Saison Active

source: Create Season
es: Crear Temporada
fr: Créer une Saison

source: Archived
es: Archivado
fr: Archivé

source: Traditional
es: Tradicional
fr: Traditionnel

source: Shift Mode
es: Modo de Turnos
fr: Mode Périodes

source: Show Archived
es: Mostrar Archivados
fr: Afficher Archivés

source: Hide Archived
es: Ocultar archivados
fr: Masquer archivés

source: Archive
es: Archivar
fr: Archiver

source: Restore
es: Restaurar
fr: Restaurer

source: Export CSV
es: Exportar CSV
fr: Exporter CSV

source: Input Metrics
es: Ingresar Métricas
fr: Saisir les Métriques

source: View Metrics
es: Ver Métricas
fr: Voir les Métriques

source: Attendance
es: Asistencia
fr: Présence

source: Formation
es: Formación

source: End Game
es: Finalizar Juego
fr: Terminer le Match

source: Database Diagnostics
es: Diagnósticos de base de datos
fr: Diagnostics de base de données

source: No Archived Teams
es: No hay equipos archivados
fr: Aucune équipe archivée

source: No Teams Yet
es: Aún no hay equipos
fr: Aucune équipe encore

# noArchivedTeamsDescription
source: You don't have any archived teams.
es: No tienes equipos archivados.
fr: Vous n'avez aucune équipe archivée.

# noTeamsYetDescription
source: Create your first team to start managing players, formations, and games.
es: Crea tu primer equipo para comenzar a gestionar jugadores, formaciones y juegos.
fr: Créez votre première équipe pour commencer à gérer les joueurs, formations et jeux.

# noActiveSeasonFound
source: No active season found. Please create a season first.
es: No se encontró temporada activa. Por favor, crea una temporada primero.
fr: Aucune saison active trouvée. Veuillez d'abord créer une saison.

# creatingTeamFor
source: Creating team for: {seasonName}
es: Creando equipo para: {seasonName}
fr: Création d'équipe pour : {seasonName}

source: No Active Season
es: Sin temporada activa
fr: Aucune saison active

# createSeasonToManageTeams
source: Create a season to start managing teams.
es: Crea una temporada para comenzar a gestionar equipos.
fr: Créez une saison pour commencer à gérer les équipes.

# errorLoadingTeams
source: Error loading teams: {error}
es: Error cargando equipos: {error}
fr: Erreur lors du chargement des équipes : {error}

source: Restore team
es: Restaurar equipo
fr: Restaurer l'équipe

source: Archive team
es: Archivar equipo
fr: Archiver l'équipe

source: Edit team
es: Editar equipo
fr: Modifier l'équipe

# errorLoadingSeason
source: Error loading season: {error}
es: Error cargando temporada: {error}
fr: Erreur lors du chargement de la saison : {error}

source: Games
es: Juegos
fr: Jeux

source: Create Game
es: Crear juego
fr: Créer un jeu

source: Win
es: Victoria
fr: Victoire

source: Loss
es: Derrota
fr: Défaite

source: Draw
es: Empate
fr: Match nul

source: No Archived Games
es: No hay juegos archivados
fr: Aucun jeu archivé

source: No Games Yet
es: Aún no hay juegos
fr: Aucun jeu encore

# noArchivedGamesDescription
source: You don't have any archived games.
es: No tienes juegos archivados.
fr: Vous n'avez aucun jeu archivé.

# noGamesYetDescription
source: Schedule your first game to start tracking match performance and player statistics.
es: Programa tu primer juego para comenzar a rastrear el rendimiento del partido y las estadísticas de los jugadores.
fr: Programmez votre premier jeu pour commencer à suivre les performances des matchs et les statistiques des joueurs.

source: Start Game
es: Iniciar juego
fr: Commencer le jeu

source: Pause
es: Pausar

source: Resume
es: Reanudar
fr: Reprendre

source: Start
es: Iniciar
fr: Commencer

# firstHalf
source: 1st Half
es: 1er Tiempo
fr: 1ère Mi-temps

# secondHalf
source: 2nd Half
es: 2do Tiempo
fr: 2ème Mi-temps

source: Halftime
es: Medio Tiempo
fr: Mi-temps

source: Overtime
es: Tiempo Extra
fr: Prolongations

source: Complete Game
es: Completar Juego
fr: Terminer le Match

source: Completing...
es: Completando...
fr: Finalisation...

source: Players
es: Jugadores
fr: Joueurs

source: No Players Yet
es: Aún no hay jugadores
fr: Aucun joueur encore

# addPlayersDescription
source: Add players to your team roster to get started with lineup management.
es: Agrega jugadores a la plantilla de tu equipo para comenzar con la gestión de alineaciones.
fr: Ajoutez des joueurs à l'effectif de votre équipe pour commencer la gestion des alignements.

source: Add Player
es: Agregar jugador
fr: Ajouter joueur

source: Import CSV
es: Importar CSV
fr: Importer CSV

# newPlayer
source: New
es: Nuevo
fr: Nouveau

source: Player
es: Jugador
fr: Joueur

source: Formations
es: Formaciones

source: Create Formation
es: Crear Formación
fr: Créer une Formation

source: Metrics
es: Métricas
fr: Métriques

source: Reset to Defaults
es: Restablecer a Valores Predeterminados
fr: Réinitialiser aux Valeurs par Défaut

source: Reset Settings
es: Restablecer Configuración
fr: Réinitialiser les Paramètres

# resetConfirmation
source: Are you sure you want to reset all alarm settings to their default values? This action cannot be undone.
es: ¿Estás seguro de que quieres restablecer todas las configuraciones de alarma a sus valores predeterminados? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir réinitialiser tous les paramètres d'alarme à leurs valeurs par défaut ? Cette action ne peut pas être annulée.

source: Settings reset to defaults
es: Configuración restablecida a valores predeterminados
fr: Paramètres réinitialisés aux valeurs par défaut

source: Current Configuration
es: Configuración Actual
fr: Configuration Actuelle

source: Enabled
es: Habilitado
fr: Activé

source: Disabled
es: Deshabilitado
fr: Désactivé

source: On
es: Encendido
fr: Activé

source: Off
es: Apagado
fr: Désactivé

source: Run Diagnostics
es: Ejecutar diagnósticos
fr: Exécuter les diagnostics

source: Export Database
es: Exportar base de datos
fr: Exporter la base de données

source: Import Database
es: Importar base de datos
fr: Importer la base de données

source: Reset Database
es: Restablecer base de datos
fr: Réinitialiser la base de données

source: Diagnostic Results
es: Resultados del diagnóstico
fr: Résultats du diagnostic

source: Database Diagnostic Tool
es: Herramienta de diagnóstico de base de datos
fr: Outil de diagnostic de base de données

# databaseDiagnosticDescription
source: This tool will help identify database issues and check if your teams are still in the database.
es: Esta herramienta ayudará a identificar problemas de la base de datos y verificar si tus equipos siguen en la base de datos.
fr: Cet outil aidera à identifier les problèmes de base de données et vérifier si vos équipes sont toujours dans la base de données.

source: Create Test Team
es: Crear equipo de prueba
fr: Créer équipe de test

source: Running diagnostics...
es: Ejecutando diagnósticos...
fr: Exécution des diagnostics...

# databaseExported
source: Database exported successfully
es: Base de datos exportada exitosamente
fr: Base de données exportée avec succès

# databaseImported
source: Database imported successfully
es: Base de datos importada exitosamente
fr: Base de données importée avec succès

source: Export failed
es: Exportación falló
fr: Échec de l'exportation

source: Import failed
es: Importación falló
fr: Échec de l'importation

# cannotBeUndone
source: THIS CANNOT BE UNDONE!
es: ¡ESTO NO SE PUEDE DESHACER!
fr: CECI NE PEUT PAS ÊTRE ANNULÉ !

# startOverWarning
source: Only proceed if you want to completely start over with a fresh database.
es: Solo procede si quieres empezar completamente de nuevo con una base de datos fresca.
fr: Ne procédez que si vous voulez recommencer complètement avec une base de données fraîche.

source: Team Logo
es: Logo del Equipo
fr: Logo de l'Équipe

source: Select Team Logo
es: Seleccionar Logo del Equipo
fr: Sélectionner le Logo de l'Équipe

source: Choose from Gallery
es: Elegir de la Galería
fr: Choisir dans la Galerie

source: Take Photo
es: Tomar Foto
fr: Prendre une Photo

source: Team Color Palette
es: Paleta de colores del equipo
fr: Palette de couleurs de l'équipe

source: Pick Color
es: Elegir color
fr: Choisir la couleur

source: Advanced Picker
es: Selector avanzado
fr: Sélecteur avancé

source: Team Management Hub
es: Centro de gestión del equipo
fr: Centre de gestion d'équipe

source: Team Management
es: Gestión del equipo
fr: Gestion d'équipe

source: Game Management
es: Gestión de juegos
fr: Gestion des matchs

# manageTeamRosterDescription
source: Manage team roster and player status
es: Gestionar plantilla del equipo y estado de jugadores
fr: Gérer l'effectif de l'équipe et le statut des joueurs

# setupTacticalFormationsDescription
source: Set up tactical formations and positions
es: Configurar formaciones tácticas y posiciones
fr: Configurer les formations tactiques et les positions

# scheduleGamesDescription
source: Schedule games and track match history
es: Programar juegos y seguir historial de partidos
fr: Programmer les matchs et suivre l'historique des matchs

# viewPlayerStatisticsDescription
source: View all-time player statistics and performance
es: Ver estadísticas y rendimiento de jugadores de todos los tiempos
fr: Voir les statistiques et performances de tous les temps des joueurs

source: Team Metrics
es: Métricas del equipo
fr: Métriques de l'équipe

source: Active Games
es: Juegos activos
fr: Matchs actifs

source: No Active Games
es: No hay juegos activos
fr: Aucun match actif

# startGameForQuickAccess
source: Start a game to see it here for quick access
es: Inicia un juego para verlo aquí y acceder rápidamente
fr: Démarrez un match pour le voir ici pour un accès rapide

source: Quick Actions
es: Acciones rápidas
fr: Actions rapides

source: Language changed to
es: Idioma cambiado a
fr: Langue changée pour

source: Close
es: Cerrar
fr: Fermer

source: No Formations Yet
es: Aún No Hay Formaciones
fr: Aucune Formation Encore

# noFormationsYetDescription
source: Create tactical formations to organize your team's positioning and strategy.
es: Crea formaciones tácticas para organizar el posicionamiento y la estrategia de tu equipo.
fr: Créez des formations tactiques pour organiser le positionnement et la stratégie de votre équipe.

# createFormationTooltip
source: Create formation
es: Crear formación
fr: Créer une formation

source: Edit Formation
es: Editar Formación
fr: Modifier la Formation

source: Delete Formation
es: Eliminar Formación
fr: Supprimer la Formation

# deleteFormationTitle
source: Delete formation?
es: ¿Eliminar formación?
fr: Supprimer la formation ?

# deleteFormationMessage
source: Delete "{formationName}"?
es: ¿Eliminar "{formationName}"?
fr: Supprimer "{formationName}" ?

# playersCount
source: {count} players
es: {count} jugadores
fr: {count} joueurs

source: No date
es: Sin fecha
fr: Aucune date

source: Opponent
es: Oponente
fr: Adversaire

source: Pick date/time
es: Elegir fecha/hora
fr: Choisir date/heure

source: No formation
es: Sin formación
fr: Aucune formation

source: Manage formations
es: Gestionar formaciones
fr: Gérer les formations

# manageFormationsTooltip
source: Manage formations
es: Gestionar formaciones
fr: Gérer les formations

# noPlayersFoundForTeam
source: No players found for this team.
es: No se encontraron jugadores para este equipo.
fr: Aucun joueur trouvé pour cette équipe.

# playerIdLabel
source: Player ID: {playerId}
es: ID del Jugador: {playerId}
fr: ID du Joueur : {playerId}

source: Manage
es: Gestionar
fr: Gérer

source: Select Metric Type
es: Seleccionar Tipo de Métrica
fr: Sélectionner le Type de Métrique

source: Quick Entry
es: Entrada Rápida
fr: Saisie Rapide

source: View Overview
es: Ver Resumen
fr: Voir l'Aperçu

source: Added {metric}
es: Agregado {metric}
fr: Ajouté {metric}

source: Removed {metric}
es: Eliminado {metric}
fr: Retiré {metric}

source: Quick {metric} Entry
es: Entrada Rápida de {metric}
fr: Saisie Rapide de {metric}

# tapPlayersWhoScored
source: Tap players who scored {metric}s:
es: Toca los jugadores que anotaron {metric}s:
fr: Touchez les joueurs qui ont marqué des {metric}s :

source: Apply
es: Aplicar
fr: Appliquer

# addedMultipleMetrics
source: Added {count} {metric}s
es: Agregados {count} {metric}s
fr: Ajouté {count} {metric}s

source: Goal
es: Gol
fr: But

source: Assist
es: Asistencia
fr: Passe décisive

source: Creating season...
es: Creando temporada...
fr: Création de la saison...

source: Season created successfully!
es: ¡Temporada creada exitosamente!
fr: Saison créée avec succès !

# errorCreatingSeason
source: Error creating season: {error}
es: Error creando temporada: {error}
fr: Erreur lors de la création de la saison : {error}

source: Cloning season...
es: Clonando temporada...
fr: Clonage de la saison...

source: Season cloned successfully!
es: ¡Temporada clonada exitosamente!
fr: Saison clonée avec succès !

# errorCloningSeason
source: Error cloning season: {error}
es: Error clonando temporada: {error}
fr: Erreur lors du clonage de la saison : {error}

source: Season activated!
es: ¡Temporada activada!
fr: Saison activée !

# errorActivatingSeason
source: Error activating season: {error}
es: Error activando temporada: {error}
fr: Erreur lors de l'activation de la saison : {error}

source: Archive Season
es: Archivar Temporada
fr: Archiver la Saison

source: Season archived!
es: ¡Temporada archivada!
fr: Saison archivée !

# errorArchivingSeason
source: Error archiving season: {error}
es: Error archivando temporada: {error}
fr: Erreur lors de l'archivage de la saison : {error}

source: Season updated!
es: ¡Temporada actualizada!
fr: Saison mise à jour !

# errorUpdatingSeason
source: Error updating season: {error}
es: Error actualizando temporada: {error}
fr: Erreur lors de la mise à jour de la saison : {error}

source: Activate
es: Activar
fr: Activer

source: Clone Season
es: Clonar Temporada
fr: Cloner la Saison

source: Create New Season
es: Crear Nueva Temporada
fr: Créer une Nouvelle Saison

source: Start Date
es: Fecha de Inicio
fr: Date de Début

source: End Date (Optional)
es: Fecha de Fin (Opcional)
fr: Date de Fin (Optionnel)

source: No existing teams to clone
es: No hay equipos existentes para clonar
fr: Aucune équipe existante à cloner

# cloneSeasonTitle
source: Clone "{seasonName}"
es: Clonar "{seasonName}"
fr: Cloner "{seasonName}"

source: Error
fr: Erreur

source: Color
fr: Couleur

# errorWithDetails
source: Error: {error}
fr: Erreur : {error}
